app/controllers/create_controller.rb

  def submit
    @map_data = params[:map_data]
    @m = Map.create map_data: @map_data
---
INSERT INTO "maps" ("created_at", "map_data", "updated_at") VALUES ($1, $2, $3) RETURNING "id"