app/controllers/view_controller.rb

  def view
    @mapid = params[:mapid]
    @map = Map.find_by(id: @mapid)
---
SELECT  "maps".* FROM "maps"  WHERE "maps"."id" = 3 LIMIT 1